
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаработнаяПлатаФактическийПериодДействия.Сотрудник,
	|	ЗаработнаяПлатаФактическийПериодДействия.ВидРасчета,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияНачало,
	|	ЗаработнаяПлатаФактическийПериодДействия.ПериодДействияКонец
	|ИЗ
	|	РегистрРасчета.ЗаработнаяПлата.ФактическийПериодДействия КАК ЗаработнаяПлатаФактическийПериодДействия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Точка = ДиаграмммаГанта.УстановитьТочку(ВыборкаДетальныеЗаписи.Сотрудник);
		Серия = ДиаграмммаГанта.УстановитьСерию(ВыборкаДетальныеЗаписи.ВидРасчета);
		
		Значение = ДиаграмммаГанта.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = ВыборкаДетальныеЗаписи.ПериодДействияНачало;
		Интервал.Конец = ВыборкаДетальныеЗаписи.ПериодДействияКонец;
	КонецЦикла;
		
КонецПроцедуры
